import React from 'react';

const Terms = () => {
  return (
    <div>
        <hr></hr>
      <h1>이용약관</h1>
      <p><strong>제1조 (목적)</strong></p>
      <p>이 약관은 회사명(이하 "회사"라 함)이 제공하는 서비스의 이용 조건과 회사와 회원 간의 권리, 의무 및 책임 사항을 규정함을 목적으로 합니다.</p>
      <p><strong>제2조 (정의)</strong></p>
      <p>1. "회원"이란 회사의 서비스에 가입하여 이용할 수 있는 자를 말합니다.</p>
      <p>2. "서비스"란 회사가 제공하는 모든 서비스를 의미합니다.</p>
      <p><strong>제3조 (회원가입)</strong></p>
      <p>1. 서비스를 이용하고자 하는 자는 회사가 요구하는 회원가입 양식에 따라 필요한 정보를 제공하여야 합니다.</p>
      <p>2. 회사는 회원가입 신청에 대한 승낙 여부를 회원가입 양식의 제출 후 즉시 통지합니다.</p>
      <p><strong>제4조 (개인정보보호)</strong></p>
      <p>1. 회사는 회원의 개인정보를 보호하기 위해 최선을 다하며, 개인정보 처리에 관한 법령을 준수합니다.</p>
      <p>2. 회원의 개인정보는 회원의 동의 없이 타인에게 제공되지 않습니다.</p>
      <p><strong>제5조 (서비스 이용)</strong></p>
      <p>1. 회원은 서비스를 본래의 목적에 맞게 이용하여야 하며, 타인에게 피해를 주어서는 안 됩니다.</p>
      <p>2. 회원은 서비스를 이용함으로써 얻은 정보를 회사의 사전 동의 없이 영리 목적으로 이용할 수 없습니다.</p>
      <p><strong>제6조 (서비스의 중단)</strong></p>
      <p>1. 회사는 서비스의 제공을 필요에 따라 중단할 수 있으며, 이에 대한 사전 통지가 가능한 경우 사전에 회원에게 통지합니다.</p>
      <p>2. 회사는 서비스의 중단으로 발생하는 문제에 대해 어떠한 책임도 부담하지 않습니다.</p>
      <p><strong>제7조 (이용제한)</strong></p>
      <p>1. 회사는 회원이 이 약관을 위반하거나 서비스의 정상적인 운영을 방해한 경우, 해당 회원의 서비스 이용을 일시적으로 정지하거나 영구적으로 중단할 수 있습니다.</p>
      <p>2. 회사는 회원에게 서비스 이용 제한 사유를 통지하고, 회원은 통지를 받은 후 정당한 이의를 제기할 수 있습니다.</p>
      <p><strong>제8조 (손해배상)</strong></p>
      <p>회원이 서비스 이용으로 인해 회사에 손해를 입힌 경우, 해당 회원은 회사에 대한 손해배상 의무를 지며, 회사는 이에 대한 적절한 대응을 취할 수 있습니다.</p>
    </div>
  );
};

export default Terms;